## Plan Result (sbox_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 50 to add, 5 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;09-ingest09-di001-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-di002-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-dp001-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-dp002-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-external-storage-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-logging-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-logic-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-management-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-metadata-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-network-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-runtimes-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-shared-integration-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-shared-product-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-storage-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_bastion_host.this[0]
  * module.data_landing_zone[&#34;00&#34;].azurerm_public_ip.bastion[0]
  * module.data_landing_zone[&#34;01&#34;].azurerm_bastion_host.this[0]
  * module.data_landing_zone[&#34;01&#34;].azurerm_public_ip.bastion[0]
  * module.logic[&#34;09&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;09&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;09&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.logic[&#34;09&#34;].azurerm_role_assignment.storage
  * module.logic[&#34;09&#34;].azurerm_service_plan.this
  * module.logic[&#34;09&#34;].azurerm_storage_account.this
  * module.logic[&#34;09&#34;].azurerm_storage_account_network_rules.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-AzureBastionSubnet&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09landingsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09curatedsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09rawsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest09-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest09-metadata-mssql-sbox&#34;]
  * module.logic[&#34;09&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;09&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Update
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
* Replace
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;raw-blob&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["09-ingest09-di001-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-di001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-di002-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-di002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-dp001-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-dp001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-dp002-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-dp002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-external-storage-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-external-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-logging-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-logging-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-logic-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-management-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-management-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-metadata-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-metadata-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-network-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-runtimes-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-runtimes-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-shared-integration-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-shared-product-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-product-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-storage-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_bastion_host.this[0] will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "uksouth"
      + name                      = "ingest00-bastion"
      + resource_group_name       = "ingest00-network-sbox"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "ingest00-bastion-ip-config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.data_landing_zone["00"].azurerm_public_ip.bastion[0] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "ingest00-bastion-pip"
      + resource_group_name     = "ingest00-network-sbox"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.data_landing_zone["01"].azurerm_bastion_host.this[0] will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "uksouth"
      + name                      = "ingest01-bastion"
      + resource_group_name       = "ingest01-network-sbox"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "ingest01-bastion-ip-config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.data_landing_zone["01"].azurerm_public_ip.bastion[0] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "ingest01-bastion-pip"
      + resource_group_name     = "ingest01-network-sbox"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.logic["09"].azurerm_logic_app_standard.this will be created
  + resource "azurerm_logic_app_standard" "this" {
      + app_service_plan_id                      = (known after apply)
      + app_settings                             = (known after apply)
      + bundle_version                           = "[1.*, 2.0.0)"
      + client_affinity_enabled                  = (known after apply)
      + custom_domain_verification_id            = (known after apply)
      + default_hostname                         = (known after apply)
      + enabled                                  = true
      + ftp_publish_basic_authentication_enabled = true
      + https_only                               = false
      + id                                       = (known after apply)
      + kind                                     = (known after apply)
      + location                                 = "uksouth"
      + name                                     = "ingest09-logic-sbox"
      + outbound_ip_addresses                    = (known after apply)
      + possible_outbound_ip_addresses           = (known after apply)
      + public_network_access                    = (known after apply)
      + resource_group_name                      = "ingest09-logic-sbox"
      + scm_publish_basic_authentication_enabled = true
      + site_credential                          = (known after apply)
      + storage_account_access_key               = (sensitive value)
      + storage_account_name                     = "ingest09logicsbox"
      + storage_account_share_name               = (known after apply)
      + tags                                     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + use_extension_bundle                     = true
      + version                                  = "~4"
      + virtual_network_subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest09-vnet-sbox/subnets/ingest09-data-product-001-sbox"

      + connection_string (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config (known after apply)
    }

  # module.logic["09"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest09logicsbox-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest09-logic-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest09-vnet-sbox/subnets/ingest09-services-sbox"
      + tags                     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest09logicsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.logic["09"].azurerm_resource_group_template_deployment.sqlConn will be created
  + resource "azurerm_resource_group_template_deployment" "sqlConn" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "logicapp-sql-conn-deployment"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "ingest09-logic-sbox"
      + template_content    = jsonencode(
            {
             

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

        = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest09curatedsbox"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest09rawsbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest09rawsbox"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this["ingest09-integration-databricks001-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_databricks" "this" {
      + adb_domain                 = "https://adb-53986474617798.18.azuredatabricks.net"
      + data_factory_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                         = (known after apply)
      + integration_runtime_name   = "AutoResolveIntegrationRuntime"
      + msi_work_space_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.Databricks/workspaces/ingest09-integration-databricks001-sbox"
      + name                       = "ingest09-integration-databricks001-sbox"

      + new_cluster_config {
          + cluster_version             = "7.3.x-scala2.12"
          + custom_tags                 = {
              + "Data-Ingest-Project" = "AJB Test Zone"
              + "application"         = "dlrm-data-ingest"
              + "autoShutdown"        = "true"
              + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
              + "businessArea"        = "cross-cutting"
              + "criticality"         = "Low"
              + "environment"         = "sandbox"
              + "expiresAfter"        = "3000-01-01"
              + "startupMode"         = "always"
            }
          + driver_node_type            = "Standard_DS3_v2"
          + max_number_of_workers       = 15
          + min_number_of_workers       = 1
          + node_type                   = "Standard_DS3_v2"
          + spark_environment_variables = {
              + "PYSPARK_PYTHON" = "/databricks/python3/bin/python3"
            }
        }
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this["MetadataControl"] will be created
  + resource "azurerm_data_factory_linked_service_azure_sql_database" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest09-metadata-mssql-sbox.database.windows.net;Initial Catalog=MetadataControl"
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "MetadataControl"
      + use_managed_identity     = true
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest09-meta001-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest09-meta001-sbox"
      + name                     = "ingest09-meta001-sbox"
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest09-meta002-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest09-meta002-sbox"
      + name                     = "ingest09-meta002-sbox"
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this["ingest09-metadata-mssql-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_sql_server" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest09-metadata-mssql-sbox.database.windows.net"
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest09-metadata-mssql-sbox"
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-blob"] is tainted, so must be replaced
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "982971809189312032" -> (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["curated-dfs"] is tainted, so must be replaced
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "1159072093051754876" -> (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["raw-blob"] is tainted, so must be replaced
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "1239203290146032892" -> (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest09curatedsbox"
        name                               = "ingest09curatedsbox"
        tags                               = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest09externalsbox"
        name                               = "ingest09externalsbox"
        tags                               = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest09landingsbox"
        name                               = "ingest09landingsbox"
        tags                               = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest09rawsbox"
        name                               = "ingest09rawsbox"
        tags                               = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest09workspacesbox"
        name                               = "ingest09workspacesbox"
        tags                               = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.logic["09"].module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "data-landing-sbox"
      + resource_group_name                   = "ingest09-logic-sbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.logic["09"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - data-landing-sbox"
      + resource_group_name = "ingest09-logic-sbox"
      + scopes              = (known after apply)
      + tags                = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 50 to add, 5 to change, 7 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["09"].module.runtimes_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-runtimes-sbox/providers/Microsoft.DataFactory/factories/ingest09-runtimes-dataFactory001-sbox"
        name                             = "ingest09-runtimes-dataFactory001-sbox"
        tags                             = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest09-integration-dataFactory001-sbox"
        name                             = "ingest09-integration-dataFactory001-sbox"
        tags                             = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":75,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->